Catalogs/ПравилаПредставленияОтчетовУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПравилаПредставленияОтчетовУплатыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиБухгалтера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтставаниеБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИнформацияНаИТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныйПервыйНалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасширенногоПервогоНалоговогоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаОтчетаОграничена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьСрокВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПериодИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйСрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренестиСрокНачалаНаРабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяЕдинымПомощником</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьИмяРодительскойЗадачиИзПредставленияЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
					<Comment>объединяются по "И"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОснованияПродленияСроков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОснованиеПродленияСроковНалоговОтчетов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВариантыПримененияТребованийЗаконодательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВариантыПримененияТребованийЗаконодательства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалогиОтчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НалогиОтчеты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолученИзВнешнегоСервиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтключенПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалогОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиБухгалтера</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаПредставленияОтчетовУплатыНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДействийКалендаряБухгалтера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДействийКалендаряБухгалтера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярныйПлатеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребованиеФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументСЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовыеЗадачи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаПредставленияОтчетовУплатыНалогов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет правила, которые действуют для переданной организации в переданном интервале времени.
//
// Параметры:
//  Правила      - ТаблицаЗначений - см.НовыйТаблицаПравил()
//  Отбор        - Структура - см. ОтборПравилЗаполнения()
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц, Неопределено - если передан менеджер, то в менеджер может быть
//                    помещена таблица ПравилаУплатыНалоговНаМестах. Это позволит, при необходимости, переиспользовать
//                    данные таблицы. Таблица может не быть помещена в менеджер, если список правил оказался пустым.
//
Процедура ЗаполнитьПравилаОрганизации(Правила, Отбор, МенеджерВременныхТаблиц = Неопределено, ДетализироватьДоПериода = Истина) Экспорт
	
	Если Отбор.НачалоИнтервала >= Отбор.КонецИнтервала Тогда
		Возврат;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ЗадачиБухгалтераПереопределяемый.СоздатьПравилаУплатыНалоговНаМестах(
		МенеджерВременныхТаблиц,
		Отбор.Организация,
		Отбор.ИмяЗадачи,
		Отбор.ТекущийПериод);
	
	// Таблица АктуальныеПравила содержит действующие в интервале правила в разрезе финансовых периодов
	СоздатьАктуальныеПравила(МенеджерВременныхТаблиц, Отбор);
	
	// В актуальных правилах проверим выполнение условий.
	// Для этого сначала определим, какие условия надо выполнить (в разрезе правил и финансовых периодов)
	// Упорядочим эти условия по возрастанию сложности.
	// Сразу отсечем условия, которые требуют ручного выбора отчетов и задач.
	
	ПорядокУсловий = Новый ТаблицаЗначений;
	ПорядокУсловий.Колонки.Добавить("Условие", ОписаниеТипаУсловияПримененияТребованияЗаконодательства());
	ПорядокУсловий.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	Для Каждого Условие Из УсловияПримененияТребованийЗаконодательства.УсловияПоВозрастаниюСложности() Цикл
		НоваяСтрока = ПорядокУсловий.Добавить();
		НоваяСтрока.Условие = Условие;
		НоваяСтрока.Порядок = ПорядокУсловий.Индекс(НоваяСтрока);
	КонецЦикла;
	
	УсловияВключаемыеВручную = Новый Массив;
	УсловияВключаемыеВручную.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеПравилоВыбраноПользователем());
	УсловияВключаемыеВручную.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеЗадачаВыбранаПользователем());
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПорядокУсловий", ПорядокУсловий);
	Запрос.УстановитьПараметр("УсловияВключаемыеВручную", УсловияВключаемыеВручную);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУсловий.Условие КАК Условие,
	|	ПорядокУсловий.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПорядокУсловий
	|ИЗ
	|	&ПорядокУсловий КАК ПорядокУсловий
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Условие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Условия.Ссылка КАК Правило
	|ПОМЕСТИТЬ ВключаютсяТолькоВручную
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК Условия
	|ГДЕ
	|	Условия.Условие В (&УсловияВключаемыеВручную)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеПравила.ФинансовыйПериод КАК ФинансовыйПериод,
	|	АктуальныеПравила.Правило КАК Правило,
	|	ЕСТЬNULL(Условия.Условие, НЕОПРЕДЕЛЕНО) КАК Условие
	|ПОМЕСТИТЬ Условия
	|ИЗ
	|	АктуальныеПравила КАК АктуальныеПравила
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК Условия
	|		ПО АктуальныеПравила.Правило = Условия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВключаютсяТолькоВручную КАК ВключаютсяТолькоВручную
	|		ПО АктуальныеПравила.Правило = ВключаютсяТолькоВручную.Правило
	|ГДЕ
	|	ВключаютсяТолькоВручную.Правило ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Правила.Ссылка КАК Правило,
	|	Правила.ФинансовыйПериод КАК ДлительностьФинансовогоПериода,
	|	УсловияПоПериодам.ФинансовыйПериод КАК ФинансовыйПериод,
	|	УсловияПоПериодам.Условие КАК Условие,
	|	ЕСТЬNULL(ПорядокУсловий.Порядок, 1000) КАК Порядок
	|ИЗ
	|	Условия КАК УсловияПоПериодам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Правила
	|		ПО УсловияПоПериодам.Правило = Правила.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокУсловий КАК ПорядокУсловий
	|		ПО УсловияПоПериодам.Условие = ПорядокУсловий.Условие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ ПО
	|	ФинансовыйПериод,
	|	Правило";
	
	// Получим перечень выполненных условий по данным явной настройки пользователя.
	// Они связаны друг с другом и не зависят от периода - их дешевле получить заранее.
	ПроверенныеГлобальныеУсловия = РегистрыСведений.ВариантыПримененияТребованийЗаконодательства.УсловияИзНастроек(Отбор.Организация);
	
	// Некоторые условия достаточно проверять только один раз
	НепериодическиеУсловия = УсловияПримененияТребованийЗаконодательства.НепериодическиеУсловия();
	
	// Для оптимизации предполагаем: если условие выполняется в начале и конце периода проверки, то оно выполняется и во
	// всех периодах между ними.
	ПроверяемыеНаГраницах = Новый Массив;
	Если Отбор.ПроверятьУсловияТолькоНаГраницахОбзора Тогда
		ПроверяемыеНаГраницах.Добавить(УсловияПримененияТребованийЗаконодательства.УсловиеВыплачиваетсяЗарплата());
	КонецЕсли;
	
	// В зависимости от того, требуется ли детализация до периода, коллекция будет содержать все правила или будет
	// обнуляться при обработке каждого периода.
	ПравилаСВыполненнымиУсловиями = Новый Соответствие; 
	
	// Проверим, что условия выполняются (в каждом периоде)
	Периоды = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Рассчитаем возможные условия применения правил сразу за весь период.
	УсловияПримененияПравил = УсловияПримененияПравил(Отбор.Организация);
	ЗадачиБухгалтераПереопределяемый.ЗаполнитьУсловияПримененияПравил(
		УсловияПримененияПравил,
		Отбор.Организация,
		Отбор.НачалоИнтервала,
		Отбор.КонецИнтервала);
	
	Пока Периоды.Следующий() Цикл
		
		ПроверенныеУсловия = Новый Соответствие;
		Для Каждого КлючИЗначение Из ПроверенныеГлобальныеУсловия Цикл
			ПроверенныеУсловия.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		ВсеПравила = Периоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВсеПравила.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ПравилаСВыполненнымиУсловиями[ВсеПравила.Правило]) Тогда
				// Это правило уже есть в списке
				Продолжить;
			КонецЕсли;
			
			УсловияДляПроверки = Новый Массив;
			
			ЕстьНеВыполненноеУсловие = Ложь;
			Условия = ВсеПравила.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Условия.Следующий() Цикл
				
				Если Условия.Условие = Неопределено Тогда
					// Не задано никаких условий
					РезультатПроверки = Истина;
				Иначе
					РезультатПроверки = ПроверенныеУсловия[Условия.Условие];
				КонецЕсли;
				
				Если РезультатПроверки = Ложь Тогда
					ЕстьНеВыполненноеУсловие = Истина;
					Прервать;
				ИначеЕсли РезультатПроверки = Неопределено Тогда
					Если УсловияДляПроверки.Найти(Условия.Условие) = Неопределено Тогда
						УсловияДляПроверки.Добавить(Условия.Условие);
					КонецЕсли;
				Иначе
					// Условие проверено - выполняется
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьНеВыполненноеУсловие Тогда
				// Другие условия не проверяем - все равно, это правило к организации в этом периоде не применяется
				Продолжить;
			КонецЕсли;
			
			Если УсловияДляПроверки.Количество() = 0 Тогда
				// Все условия проверены - правило надо выполнять
				ПравилаСВыполненнымиУсловиями.Вставить(ВсеПравила.Правило, Истина);
				Продолжить;
			КонецЕсли;
			
			ВыполненныеУсловия = Новый Массив;
			НеВыполненноеУсловие = УсловияПримененияТребованийЗаконодательства.ПроверитьУсловия(
				УсловияПримененияПравил,
				УсловияДляПроверки,
				ВсеПравила.ФинансовыйПериод,
				ВсеПравила.ДлительностьФинансовогоПериода,
				Отбор.Организация,
				ВыполненныеУсловия);
			
			Если НеВыполненноеУсловие = Неопределено И ПроверяемыеНаГраницах.Количество() > 0 Тогда
				
				Для Каждого ВыполненноеУсловие Из ВыполненныеУсловия Цикл
					
					ИндексУсловия = ПроверяемыеНаГраницах.Найти(ВыполненноеУсловие);
					Если ИндексУсловия = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ПроверяемыеНаГраницах.Удалить(ИндексУсловия);
					
					// Прошла проверка в начале периода. Сейчас же сделаем проверку в конце периода.
					НеВыполненноеУсловиеНаКонецИнтервала = УсловияПримененияТребованийЗаконодательства.ПроверитьУсловия(
						УсловияПримененияПравил,
						ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыполненноеУсловие),
						НачалоМесяца(Отбор.КонецИнтервала),
						ВсеПравила.ДлительностьФинансовогоПериода,
						Отбор.Организация);
					Если НеВыполненноеУсловиеНаКонецИнтервала = Неопределено Тогда
						НепериодическиеУсловия.Вставить(ВыполненноеУсловие, Истина);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
				
			Для Каждого ВыполненноеУсловие Из ВыполненныеУсловия Цикл
				ПроверенныеУсловия.Вставить(ВыполненноеУсловие, Истина);
				Если НепериодическиеУсловия[ВыполненноеУсловие] <> Неопределено Тогда
					ПроверенныеГлобальныеУсловия.Вставить(ВыполненноеУсловие, Истина);
				КонецЕсли;
			КонецЦикла;
			
			Если НеВыполненноеУсловие = Неопределено Тогда
				// Все условия проверены - правило надо выполнять
				ПравилаСВыполненнымиУсловиями.Вставить(ВсеПравила.Правило, Истина);
			Иначе
				ПроверенныеУсловия.Вставить(НеВыполненноеУсловие, Ложь);
				Если НепериодическиеУсловия[НеВыполненноеУсловие] <> Неопределено Тогда
					ПроверенныеГлобальныеУсловия.Вставить(НеВыполненноеУсловие, Ложь);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла; // ВсеПравила
		
		Если ДетализироватьДоПериода Тогда
			// Дополним коллекцию
			Для Каждого КлючИЗначение Из ПравилаСВыполненнымиУсловиями Цикл
				НоваяСтрока = Правила.Добавить();
				НоваяСтрока.Правило          = КлючИЗначение.Ключ;
				НоваяСтрока.ФинансовыйПериод = Периоды.ФинансовыйПериод;
			КонецЦикла;
			ПравилаСВыполненнымиУсловиями.Очистить();
		КонецЕсли;
		
	КонецЦикла; // Периоды
	
	Если Не ДетализироватьДоПериода Тогда
		// Дополним коллекцию
		Для Каждого КлючИЗначение Из ПравилаСВыполненнымиУсловиями Цикл
			Правила.Добавить().Правило = КлючИЗначение.Ключ;
		КонецЦикла;
	КонецЕсли;
	
	// Дополним правилами, которые действуют в силу прямого указания пользователя - 
	// выбраны им явно в списке НалогиОтчеты.
	// Возможен случай, когда правило есть в списке НалогиОтчеты, но отключено. Это произойдет, если отчет требуется
	// согласно данным внешнего сервиса, но пользователь отключил правило. В этом случае в списке будет флаг
	// ОтключенПользователем = Истина.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Отбор.Организация);
	Запрос.УстановитьПараметр("УсловиеЗадачаВыбранаПользователем", УсловияПримененияТребованийЗаконодательства.УсловиеЗадачаВыбранаПользователем());
	Запрос.УстановитьПараметр("УсловиеПравилоВыбраноПользователем", УсловияПримененияТребованийЗаконодательства.УсловиеПравилоВыбраноПользователем());
	Запрос.УстановитьПараметр("ТолькоВключенные", Отбор.ТолькоВключенные);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Правило,
	|	НалогиОтчеты.ПолученИзВнешнегоСервиса КАК ПолученИзВнешнегоСервиса,
	|	НалогиОтчеты.ОтключенПользователем КАК ОтключенПользователем
	|ПОМЕСТИТЬ ПравилаВключенныеПользователем
	|ИЗ
	|	РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО (НалогиОтчеты.НалогОтчет = ПравилаПредставленияОтчетовУплатыНалогов.Владелец)
	|ГДЕ
	|	НалогиОтчеты.НалогОтчет ССЫЛКА Справочник.ЗадачиБухгалтера
	|	И НалогиОтчеты.Организация = &Организация
	|	И (НЕ &ТолькоВключенные ИЛИ НЕ НалогиОтчеты.ОтключенПользователем)
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Условия.Условие = &УсловиеЗадачаВыбранаПользователем
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НалогиОтчеты.НалогОтчет,
	|	НалогиОтчеты.ПолученИзВнешнегоСервиса,
	|	НалогиОтчеты.ОтключенПользователем
	|ИЗ
	|	РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
	|ГДЕ
	|	НалогиОтчеты.НалогОтчет ССЫЛКА Справочник.ПравилаПредставленияОтчетовУплатыНалогов
	|	И НалогиОтчеты.Организация = &Организация
	|	И НалогиОтчеты.НалогОтчет.Условия.Условие = &УсловиеПравилоВыбраноПользователем
	|	И (НЕ &ТолькоВключенные ИЛИ НЕ НалогиОтчеты.ОтключенПользователем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило";
	Запрос.Выполнить();
	
	Если ДетализироватьДоПериода Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктуальныеПравила.Правило КАК Правило,
		|	ПравилаВключенныеПользователем.ПолученИзВнешнегоСервиса КАК ПолученИзВнешнегоСервиса,
		|	ПравилаВключенныеПользователем.ОтключенПользователем КАК ОтключенПользователем,
		|	АктуальныеПравила.ФинансовыйПериод КАК ФинансовыйПериод
		|ИЗ
		|	АктуальныеПравила КАК АктуальныеПравила
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравилаВключенныеПользователем КАК ПравилаВключенныеПользователем
		|		ПО АктуальныеПравила.Правило = ПравилаВключенныеПользователем.Правило";
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АктуальныеПравила.Правило КАК Правило
		|ПОМЕСТИТЬ АктуальныеПравилаБезПериодов
		|ИЗ
		|	АктуальныеПравила КАК АктуальныеПравила
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Правило
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеПравила.Правило КАК Правило,
		|	ПравилаВключенныеПользователем.ПолученИзВнешнегоСервиса КАК ПолученИзВнешнегоСервиса,
		|	ПравилаВключенныеПользователем.ОтключенПользователем КАК ОтключенПользователем
		|ИЗ
		|	АктуальныеПравилаБезПериодов КАК АктуальныеПравила
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравилаВключенныеПользователем КАК ПравилаВключенныеПользователем
		|		ПО АктуальныеПравила.Правило = ПравилаВключенныеПользователем.Правило";
	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Правила.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Включено = Не Выборка.ОтключенПользователем;
	КонецЦикла;

КонецПроцедуры

// Возврашает таблицу действующих правил с учетом настроек, введенных пользователем.
// В том числе может содержать правила, которые не применяются в силу того, что отключены пользователем
// (см. параметр ТолькоВключенные).   
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ТекущийПериод - Дата - дата для определения периода актуальности правил
//  ТолькоВключенные - Булево - Истина - правила, явно отключенные пользователем, не включаются
//                              в таблицу, даже если они запрошены получателем через внешний сервис;
//                              Ложь - в таблицу будут добавлены в том числе правила, отключенные пользователем принудительно  
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Действующие правила организации (см. НовыйПравилаОрганизации())
Функция ДействующиеПравилаОрганизации(Организация, ТекущийПериод = Неопределено, ТолькоВключенные = Истина) Экспорт
	
	ОтборПравил = ОтборПравилЗаполнения();
	ОтборПравил.Организация = Организация;
	ОтборПравил.ТолькоВключенные = ТолькоВключенные;
	
	Если ТекущийПериод = Неопределено Тогда
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		НачалоИнтервала = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -12));
		
		ДатаНачалаДеятельности = КалендарьБухгалтера.ДатаНачалаДеятельности(Организация);
		ОтборПравил.НачалоИнтервала = Макс(НачалоИнтервала, ДатаНачалаДеятельности);
		ОтборПравил.КонецИнтервала  = КонецГода(ДобавитьМесяц(ТекущаяДата, 12));
		
	Иначе
		
		ОтборПравил.НачалоИнтервала = НачалоМесяца(ДобавитьМесяц(НачалоГода(ТекущийПериод),-1));
		ОтборПравил.КонецИнтервала  = КонецГода(ТекущийПериод);
		ОтборПравил.ТекущийПериод   = ТекущийПериод;
		
	КонецЕсли;
	
	Правила = НовыйПравилаОрганизации();
	ЗаполнитьПравилаОрганизации(Правила, ОтборПравил,, Ложь);
	
	Возврат Правила;
	
КонецФункции

Функция НовыйПравилаОрганизации() Экспорт
	
	Правила = Новый ТаблицаЗначений;
	Правила.Колонки.Добавить("Правило",                Новый ОписаниеТипов("СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов"));
	// ФинансовыйПериод - налоговый или иной финансовый период, в котором организация обязана применять правило.
	// В большинстве случаев правила детализируются по всем финансовым периодам, входящим в интервал составления
	// перечня правил, но бывают  исключения, когда нужен "срез" правил на дату - тогда эта колонка не используется.
	// (см. параметр ДетализироватьДоПериода в ЗаполнитьПравилаОрганизации())
	Правила.Колонки.Добавить("ФинансовыйПериод",       Новый ОписаниеТипов("Дата"));
	// Для некоторых задач правила включаются пользователем
	Правила.Колонки.Добавить("Включено",               Новый ОписаниеТипов("Булево"));
	// Некоторые правила (например, формы статистики) могут быть включены по данным внешнего сервиса
	Правила.Колонки.Добавить("ПолученИзВнешнегоСервиса",   Новый ОписаниеТипов("Булево"));
	// Чтобы преодолеть автоматическую настройку, пользователь может явно отключить правило.
	// В этом случае настройка сохраняется в отдельном реквизите.
	Правила.Колонки.Добавить("ОтключенПользователем", Новый ОписаниеТипов("Булево"));
	
	Возврат Правила;
	
КонецФункции

// Задает критерии, которым должны удовлетворять правила по организации.
//
// Возвращаемое значение:
//   Структура   - критерии отбора
//     * Организация - СправочникСсылка.Организации
//     * НачалоИнтервала - Дата - дата начала периода, за который нужно составить перечень правил
//     * КонецИнтервала - Дата - дата окончания периода, за который нужно составить перечень правил
//     * ТекущийПериод - Дата - период, актуальный на момент заполнения
//     * ИмяЗадачи - Строка - отбор по имени задачи
//     * Действие - ПеречислениеСсылка.ВидыДействийКалендаряБухгалтера - отбор по типу задачи
//     * Правила - Массив - отбор по правилам
//     * ПроверятьУсловияТолькоНаГраницахОбзора - Булево - проверять некоторые правила только на границах интервала
//     * ТолькоВключенные - Булево - Истина - игнорировать правила, которые принудительно отключены пользователем,
//                                            даже если они запрошены получателем через внешний сервис
//
Функция ОтборПравилЗаполнения() Экспорт

	Отбор = Новый Структура;
	Отбор.Вставить("Организация",     Справочники.Организации.ПустаяСсылка());
	Отбор.Вставить("НачалоИнтервала", '00010101');
	Отбор.Вставить("КонецИнтервала",  '00010101');
	Отбор.Вставить("ТекущийПериод ",  '00010101');
	Отбор.Вставить("ИмяЗадачи",       "");
	Отбор.Вставить("Действие",        Перечисления.ВидыДействийКалендаряБухгалтера.ПустаяСсылка());
	Отбор.Вставить("Правила",         Новый Массив);
	Отбор.Вставить("ПроверятьУсловияТолькоНаГраницахОбзора", Ложь);
	Отбор.Вставить("ТолькоВключенные", Истина);
	
	Возврат Отбор;
	
КонецФункции

Функция СкомпоноватьПолноеИмяПравила(ИдентификаторЗадачи, ИдентификаторПравила) Экспорт
	
	Возврат Строка(ИдентификаторЗадачи) + "." + Строка(ИдентификаторПравила);
	
КонецФункции

// Возвращает идентификатор правила и задачи-владельца этого правила.
//
// Параметры:
//   Правило - СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов
//
// Возвращаемое значение:
//   Структура
//     * ИдентификаторЗадачи
//     * ИдентификаторПравила
//
Функция ИдентификаторыПравилаИЗадачи(Правило) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Правило", Правило);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Правила.Владелец.Код КАК ИдентификаторЗадачи,
	|	Правила.Код КАК ИдентификаторПравила
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Правила
	|ГДЕ
	|	Правила.Ссылка = &Правило";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Новый Структура("ИдентификаторЗадачи, ИдентификаторПравила");
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
		Возврат Результат;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолноеИмяПравила(Правило) Экспорт
	
	Идентификаторы = ИдентификаторыПравилаИЗадачи(Правило);
	
	Если Идентификаторы = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СкомпоноватьПолноеИмяПравила(Идентификаторы.ИдентификаторЗадачи, Идентификаторы.ИдентификаторПравила);
	
КонецФункции

Функция ТипПолногоИмениПравила() Экспорт
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(101);
	
КонецФункции

// Возвращает ссылку на правило по идентификатору задачи-владельца и самого правила.
//
// Параметры:
//	ИдентификаторЗадачи - Строка - Идентификатор задачи-владельца.
//	ИдентификаторПравила - Строка - Идентификатор правила.
//
// Возвращаемое значение:
//	СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов, Неопределено - Найденное правило или Неопределено.
//
Функция НайтиПоИдентификатору(ИдентификаторЗадачи, ИдентификаторПравила) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЗадачи",  ИдентификаторЗадачи);
	Запрос.УстановитьПараметр("ИдентификаторПравила", ИдентификаторПравила);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Правила
	|ГДЕ
	|	Правила.Владелец.Код = &ИдентификаторЗадачи
	|	И Правила.Код = &ИдентификаторПравила
	|	И НЕ Правила.ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Владелец");
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

// Определяет все налоговые периоды, относящиеся к дате регистрации организации, которые организация для целей уплаты налогов (представления отчетов) пропускает.
// Такие требования установлены п. 2 ст. 55 НК РФ и п. 3 ст. 15 закона "О бухгалтерском учете".
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//   ИсключаемыеПериоды - Соответствие
//    * Ключ     - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода
//    * Значение - Дата - Дата начала исключаемого финансового периода.
//
Функция ИсключаемыеПериодыПоДатеРегистрации(Организация) Экспорт
	
	ИсключаемыеПериоды = Новый Соответствие;
	
	ДатаРегистрации = КалендарьБухгалтераПовтИсп.ДатаНачалаДеятельности(Организация);
	
	Если Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Возврат ИсключаемыеПериоды;
	КонецЕсли;
	
	Для Каждого ОписаниеВарианта Из Метаданные.Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.ЗначенияПеречисления Цикл
		
		Вариант = Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода[ОписаниеВарианта.Имя];
		
		ИсключаемыйПериод = ИнтерфейсыВзаимодействияБРО.ПропущенныйНалоговыйПериод(Вариант, Организация, ДатаРегистрации);
		
		Если ЗначениеЗаполнено(ИсключаемыйПериод) Тогда
			ИсключаемыеПериоды.Вставить(Вариант, ИсключаемыйПериод);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИсключаемыеПериоды;
	
КонецФункции

// Возвращает дату начала первого финансового периода для переданного правила и организации
// с учетом даты регистрации и особенностей законодательства (статья 55 НК РФ, п. 3 ст. 15 закона "О бухгалтерском учете").
//
// Пример: для организации, зарегистрированной в декабре 2017 года, и правила для декларации УСН
// будет возвращено 01.01.2018 - начало первого года, по итогам которого потребуется сдавать декларацию.
//
// Параметры:
//  ДанныеПравила          - Структура - сведения об особенностях отчета/налога.
//                              Ключи структуры:
//                               * ФинансовыйПериод - ПеречислениеСсылка.Периодичность - периодичность предоставления отчета / уплаты налога.
//                               * РасширенныйПервыйНалоговыйПериод - ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода -
//                                                    вариант особенностей законодательства для первого налогового/отчетного периода.
//                         - СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов -
//                              правило, описывающее отчет/налог. Особенности отчета/налога будут определены из реквизитов правила.
//  Организация            - СправочникСсылка.Организации - проверяемая организация;
//  ДатаРегистрации        - Дата - дата регистрации проверяемой организации;
//                                  если не указана - будет получена из реквизитов организации.
//
// Возвращаемое значение:
//   Дата   - начало первого финансового периода.
//
Функция ПервыйФинансовыйПериод(ДанныеПравила, Организация, ДатаРегистрации = Неопределено) Экспорт
	
	ОсобенностиОтчетаНалога = Новый Структура("ФинансовыйПериод, РасширенныйПервыйНалоговыйПериод");
	
	ТипДанныхПравила = ТипЗнч(ДанныеПравила);
	
	Если ТипДанныхПравила = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ОсобенностиОтчетаНалога, ДанныеПравила);
	ИначеЕсли ТипДанныхПравила = Тип("СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов") Тогда
		ОсобенностиОтчетаНалога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеПравила, ОсобенностиОтчетаНалога);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Дату регистрации необходимо получить явно - здесь она является проверяемым периодом для БРО.
	Если ДатаРегистрации = Неопределено Тогда
		ДатаРегистрации = КалендарьБухгалтераПовтИсп.ДатаНачалаДеятельности(Организация);
	КонецЕсли;
	
	ПервыйНалоговыйПериод = ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(Организация,
		ДатаРегистрации,
		ОсобенностиОтчетаНалога.РасширенныйПервыйНалоговыйПериод,
		ОсобенностиОтчетаНалога.ФинансовыйПериод,
		ДатаРегистрации);
		
	Возврат ПервыйНалоговыйПериод.Период;
	
КонецФункции

// Создает временную таблицу АктуальныеПравила.
//
// Актуальные =
// - действуют для данной организации
// - в периоде обзора по ним могут появиться новые задачи
//
// Параметры:
//  МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц - в него будет помещена таблица.
//                             Должен содержать таблицу ПравилаУплатыНалоговНаМестах.
//  Отбор - Структура - см. ОтборПравилЗаполнения()
//
Процедура СоздатьАктуальныеПравила(МенеджерВременныхТаблиц, Отбор) Экспорт

	Правила = НовыйПравилаОрганизации();
	
	День = 24 * 60 * 60;
	ТекушаяДата = НачалоДня(ТекущаяДатаСеанса());
	ДатаНачалаДеятельности = КалендарьБухгалтера.ДатаНачалаДеятельности(Отбор.Организация);
	
	УсловияИсключения = УсловияПримененияТребованийЗаконодательства.УсловияИсключенияПоТипуОрганизации(Отбор.Организация);
	ЗадачиБухгалтераПереопределяемый.ПолучитьПравилаИсключения(МенеджерВременныхТаблиц); 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("УсловияИсключения", УсловияИсключения);
	Запрос.УстановитьПараметр("УсловиеПереопределяемое", Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Исключения
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК ПравилаПредставленияОтчетовУплатыНалоговУсловия
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Условие В(&УсловияИсключения)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПравилаИсключения.Ссылка
	|ИЗ
	|	ПравилаИсключения КАК ПравилаИсключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФедеральныеПравила.Ссылка КАК Правило,
	|	ФедеральныеПравила.ФинансовыйПериод КАК ДлительностьФинансовогоПериода,
	|	ФедеральныеПравила.НачалоДействия КАК НачалоДействия,
	|	ФедеральныеПравила.КонецДействия КАК КонецДействия,
	|	ФедеральныеПравила.Периодичность КАК Периодичность,
	|	ЕСТЬNULL(МестныеПравила.СрокМесяцев, ФедеральныеПравила.СрокМесяцев) КАК СрокМесяцев,
	|	ЕСТЬNULL(МестныеПравила.СрокДней, ФедеральныеПравила.СрокДней) КАК СрокДней,
	|	ФедеральныеПравила.ОтставаниеБазовогоПериода КАК ОтставаниеБазовогоПериода,
	|	ФедеральныеПравила.Действие КАК Действие,
	|	ФедеральныеПравила.БазовыйПериод КАК БазовыйПериод,
	|	ФедеральныеПравила.РасширенныйПервыйНалоговыйПериод КАК РасширенныйПервыйНалоговыйПериод
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ФедеральныеПравила
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаУплатыНалоговНаМестах КАК МестныеПравила
	|		ПО ФедеральныеПравила.Ссылка = МестныеПравила.Правило
	|ГДЕ
	|	НЕ ФедеральныеПравила.ПометкаУдаления
	|	И ФедеральныеПравила.ФинансовыйПериод <> ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка)
	|	И ЕСТЬNULL(МестныеПравила.Включено, ИСТИНА)
	|	И &УсловиеПоИмениЗадачи
	|	И &УсловиеПоДействию
	|	И &УсловиеПоПравилам
	|	И &УсловиеПоПериоду
	|	И &УсловиеПереопределяемое
	|	И НЕ ФедеральныеПравила.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_Исключения.Ссылка
	|				ИЗ
	|					ВТ_Исключения КАК ВТ_Исключения)";
	
	Если ЗначениеЗаполнено(Отбор.ИмяЗадачи) Тогда
		Запрос.УстановитьПараметр("ИмяЗадачи", Отбор.ИмяЗадачи);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИмениЗадачи", "Владелец.Код = &ИмяЗадачи");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИмениЗадачи", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.Действие) Тогда
		Запрос.УстановитьПараметр("Действие", Отбор.Действие);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДействию", "Действие = &Действие");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДействию", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.Правила) Тогда
		Запрос.УстановитьПараметр("ОтборПоПравилам", Отбор.Правила);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПравилам", "Код В (&ОтборПоПравилам)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПравилам", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор.ТекущийПериод) Тогда
		Запрос.УстановитьПараметр("ТекущийПериод", Отбор.ТекущийПериод);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПериоду", "
		|ВЫБОР
		|	КОГДА ФедеральныеПравила.КонецДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		ИЛИ ФедеральныеПравила.КонецДействия >= &ТекущийПериод
		|			ТОГДА ИСТИНА
		|	КОГДА ФедеральныеПравила.СрокМесяцев >= 0
		|		ИЛИ (ФедеральныеПравила.СрокМесяцев < 0
		|		И РАЗНОСТЬДАТ(ФедеральныеПравила.КонецДействия, &ТекущийПериод, МЕСЯЦ) + ФедеральныеПравила.СрокМесяцев > 0)
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ФедеральныеПравила.КонецДействия, МЕСЯЦ, ФедеральныеПравила.СрокМесяцев), ДЕНЬ, ФедеральныеПравила.СрокДней + 7) >= &ТекущийПериод
		|	ИНАЧЕ ЛОЖЬ
		| КОНЕЦ");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПериоду", "ИСТИНА");
	КонецЕсли;
	ЗадачиБухгалтераПереопределяемый.ДополнитьЗапросПриПолученииАктуальныхПравил(Запрос, ТекстЗапроса);
	
	ИсключаемыеПериоды = ИсключаемыеПериодыПоДатеРегистрации(Отбор.Организация);
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		// Если интервал обзора настолько мал, что включает в себя только один период,
		// то это правило заведомо не приведет к появлению новых задач
		Если ЗначениеЗаполнено(Отбор.НачалоИнтервала) Тогда
			КонецПервогоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(
				Выборка.Периодичность,
				Отбор.НачалоИнтервала);
			Если КонецПервогоПериода >= КонецДня(Отбор.КонецИнтервала) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Определим интервал финансовых периодов, 
		// к которым относятся задачи, инициированные в периоде обзора
		
		// Часто он совпадает с окном обзора...
		ПервыйФинансовыйПериод    = Отбор.НачалоИнтервала;
		ПоследнийФинансовыйПериод = Отбор.КонецИнтервала;
		
		// ... но есть два исключения
		СобытиеПозжеРелевантногоПериода = КалендарьБухгалтера.СрокИстекаетПослеОкончанияРелевантногоПериода(Выборка);
		БазовыйПериодОпределяетсяПросто = КалендарьБухгалтера.БазовыйПериодОпределяетсяПросто(Выборка);
		ФинансовыйПериодОпределяетсяПросто = СобытиеПозжеРелевантногоПериода И БазовыйПериодОпределяетсяПросто;
		
		Если Не ФинансовыйПериодОпределяетсяПросто Тогда
			// Первым финансовым периодом считаем тот, к которому относятся задачи, 
			// появившиеся в начало обзора или немного ранее.
			Если БазовыйПериодОпределяетсяПросто Тогда
				ДлительностьБазовогоПериода = Выборка.Периодичность;
				ОтставаниеБазовогоПериода   = 0;
			Иначе
				ДлительностьБазовогоПериода = Выборка.БазовыйПериод;
				ОтставаниеБазовогоПериода   = Выборка.ОтставаниеБазовогоПериода;
			КонецЕсли;
			
			// Базовый период всегда предшествует сроку
			КалендарьБухгалтера.УточнитьОтставаниеБазовогоПериода(
				ОтставаниеБазовогоПериода, 
				ДлительностьБазовогоПериода, 
				Выборка.СрокМесяцев);
			
			Если ЗначениеЗаполнено(Отбор.НачалоИнтервала) Тогда
				ПервыйФинансовыйПериод = ПересчитатьБазовыйПериодВФинансовый(
					Отбор.НачалоИнтервала,
					ДлительностьБазовогоПериода,
					ОтставаниеБазовогоПериода);
			КонецЕсли;
				
			ПоследнийФинансовыйПериод = ПересчитатьБазовыйПериодВФинансовый(
				Отбор.КонецИнтервала,
				ДлительностьБазовогоПериода,
				ОтставаниеБазовогоПериода);
				
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Отбор.НачалоИнтервала) Тогда
			// Первым финансовым периодом считаем тот, за который можем еще успеть выполнить
			// задачу в срок
			ПервыйФинансовыйПериод = КалендарьБухгалтера.НачалоАктуальногоПериода(
				Выборка,
				ТекушаяДата,
				ДатаНачалаДеятельности);
		КонецЕсли;
		
		// Сопоставим период обзора и период действия правила.
		// NB: здесь сравниваются финансовые периоды, а не базовые.
		Если ЗначениеЗаполнено(Выборка.НачалоДействия) Тогда
			ПервыйФинансовыйПериод = Макс(ПервыйФинансовыйПериод, Выборка.НачалоДействия);
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.КонецДействия) Тогда
			ПоследнийФинансовыйПериод = Мин(ПоследнийФинансовыйПериод, Выборка.КонецДействия);
		КонецЕсли;
		
		Если ПервыйФинансовыйПериод > ПоследнийФинансовыйПериод Тогда
			Продолжить;
		КонецЕсли;
		
		// Определим интервал финансовых периодов, 
		// к которым относятся задачи, инициированные в периоде обзора
		
		ФинансовыеПериоды = КалендарьБухгалтера.Периоды(ПервыйФинансовыйПериод, ПоследнийФинансовыйПериод, Выборка.ДлительностьФинансовогоПериода);
		
		Для Каждого ФинансовыйПериод Из ФинансовыеПериоды Цикл
			
			Если ИсключаемыеПериоды[Выборка.РасширенныйПервыйНалоговыйПериод] = ФинансовыйПериод Тогда
				// Не добавляем период, если для предусмотренного в правиле варианта расширенного первого налогового периода
				// есть исключаемый период, который совпадает с периодом задачи.
				Продолжить;
			КонецЕсли;
			
			Если ИнтерфейсыВзаимодействияБРО.ПервыйНалоговыйПериодНачинаетсяСДатыПостановкиНаУчет(Выборка.РасширенныйПервыйНалоговыйПериод) Тогда
				ДатаРегистрации = КалендарьБухгалтераПовтИсп.ДатаНачалаДеятельности(Отбор.Организация);
				КонецФинансовогоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(
					ИнтерфейсыВзаимодействияБРО.СтандартнаяДлительностьНалоговогоПериода(Выборка.РасширенныйПервыйНалоговыйПериод),
					ФинансовыйПериод);
				ДатаПостановкиНаУчет = КалендарьБухгалтераПовтИсп.ДатаПостановкиНаУчетНалогоплательщика(Отбор.Организация, КонецФинансовогоПериода);
				Если ИнтерфейсыВзаимодействияБРО.НалоговыйПериодПропущен(
						Отбор.Организация,
						ФинансовыйПериод,
						Выборка.РасширенныйПервыйНалоговыйПериод,
						ДатаРегистрации,
						ДатаПостановкиНаУчет) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если Выборка.Действие = Перечисления.ВидыДействийКалендаряБухгалтера.Уведомление Тогда
				ФинансовыйПериод = Макс(ПервыйФинансовыйПериод, ФинансовыйПериод);
				Если Правила.НайтиСтроки(Новый Структура("Правило, ФинансовыйПериод", Выборка.Правило, ФинансовыйПериод)).Количество() > 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока = Правила.Добавить();
			НоваяСтрока.Правило          = Выборка.Правило;
			НоваяСтрока.ФинансовыйПериод = ФинансовыйПериод;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Правила", Правила);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Правила.Правило КАК Правило,
	|	Правила.ФинансовыйПериод КАК ФинансовыйПериод
	|ПОМЕСТИТЬ АктуальныеПравила
	|ИЗ
	|	&Правила КАК Правила
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило,
	|	ФинансовыйПериод";
	Запрос.Выполнить();
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьОтправкаОтчетаОграничена");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

// Следует вызывать при изменении результата ИнтерфейсыВзаимодействияБРОКлиентСервер.ВозможнаОтправкаЭлектронногоДокумента
//
Процедура ЗаполнитьОтправкаОтчетаОграничена() Экспорт
	
	// Обработчик реализован исходя из предположения,
	// что перечень отчетов с ограниченной отправкой сокращается, но не увеличивается.
	
	ИсполнителиТребований = ИнтерфейсыВзаимодействияБРО.РеглОтчетыИсполнителиТребований();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Ссылка КАК Ссылка,
	|	Правила.Владелец.Код КАК ИдентификаторЗадачи,
	|	Правила.Код КАК ИдентификаторПравила
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Правила
	|ГДЕ
	|	Правила.ОтправкаОтчетаОграничена";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Требование = Справочники.ПравилаПредставленияОтчетовУплатыНалогов.СкомпоноватьПолноеИмяПравила(
			Выборка.ИдентификаторЗадачи,
			Выборка.ИдентификаторПравила);
		ИмяОтчета  = ИнтерфейсыВзаимодействияБРО.ИмяРеглОтчета(Требование, ИсполнителиТребований);
		Если Не ЗначениеЗаполнено(ИмяОтчета) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ИнтерфейсыВзаимодействияБРОКлиентСервер.ВозможнаОтправкаЭлектронногоДокумента(ИмяОтчета) Тогда
			Продолжить;
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Объект.УстановитьОтправкаОтчетаОграничена(Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПересчитатьБазовыйПериодВФинансовый(БазовыйПериод, ДлительностьБазовогоПериода, ОтставаниеБазовогоПериода)
	
	ФинансовыйПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(
		ДлительностьБазовогоПериода,
		БазовыйПериод) + 1;
		
	Если ОтставаниеБазовогоПериода > 0 Тогда
		ФинансовыйПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(
			ФинансовыйПериод,
			ДлительностьБазовогоПериода,
			ОтставаниеБазовогоПериода);
	КонецЕсли;
	
	Возврат ФинансовыйПериод;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеТипаУсловияПримененияТребованияЗаконодательства() Экспорт
	
	Возврат Метаданные.Справочники.ПравилаПредставленияОтчетовУплатыНалогов.ТабличныеЧасти.Условия.Реквизиты.Условие.Тип;
	
КонецФункции

Функция УсловияПримененияПравил(Организация) Экспорт
	
	Результат = Новый Соответствие;
	ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо");
	Результат.Вставить("ЭтоЮридическоеЛицо", ЮридическоеФизическоеЛицо <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	Результат.Вставить("ЗадачиВключенныеПользователем", УсловияПримененияТребованийЗаконодательства.ЗадачиВключенныеПользователем(Организация));
	
	ЭтоОбособленноеПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОбособленноеПодразделение");
	ЭтоГоловнаяОрганизация = Истина;
	Если ЗначениеЗаполнено(ЭтоОбособленноеПодразделение) Тогда
		ЭтоГоловнаяОрганизация = Не ЭтоОбособленноеПодразделение;
	КонецЕсли;
	
	Результат.Вставить("ЭтоГоловнаяОрганизация", ЭтоГоловнаяОрганизация);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
